ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_can.h
/**
  ******************************************************************************
  * @file    MDR32FxQI_can.h
  * @author  Milandr Application Team
  * @version V2.0.0i
  * @date    10/03/2022
  * @brief   This file contains all the functions prototypes for the CAN
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FxQI_CAN_H
#define __MDR32FxQI_CAN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxIQ Standard Peripherial Driver
  * @{
  */

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32F1QI)

/** @addtogroup CAN
  * @{
  */

/** @defgroup CAN_Exported_Types CAN Exported Types
  * @{
  */

/**
  * @brief CAN Propagation time
  */
typedef enum
{
    CAN_PSEG_Mul_1TQ = (((uint32_t)0x0) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 1 x TQ */
    CAN_PSEG_Mul_2TQ = (((uint32_t)0x1) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 2 x TQ */
    CAN_PSEG_Mul_3TQ = (((uint32_t)0x2) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 3 x TQ */
    CAN_PSEG_Mul_4TQ = (((uint32_t)0x3) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 4 x TQ */
    CAN_PSEG_Mul_5TQ = (((uint32_t)0x4) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 5 x TQ */
    CAN_PSEG_Mul_6TQ = (((uint32_t)0x5) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 6 x TQ */
    CAN_PSEG_Mul_7TQ = (((uint32_t)0x6) << CAN_BITTMNG_PSEG_Pos), /*!< Propagation time = 7 x TQ */
    CAN_PSEG_Mul_8TQ = (((uint32_t)0x7) << CAN_BITTMNG_PSEG_Pos)  /*!< Propagation time = 8 x TQ */
} CAN_Propagation_Time;

#define IS_CAN_PSEG_VALUE(VALUE)  (((VALUE) == CAN_PSEG_Mul_1TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_2TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_3TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_4TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_5TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_6TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_7TQ) || \
                                   ((VALUE) == CAN_PSEG_Mul_8TQ))

/**
  * @brief CAN Phase Segment 1 time
  */
typedef enum
{
    CAN_SEG1_Mul_1TQ = (((uint32_t)0x0) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 1 x TQ */
    CAN_SEG1_Mul_2TQ = (((uint32_t)0x1) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 2 x TQ */
    CAN_SEG1_Mul_3TQ = (((uint32_t)0x2) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 3 x TQ */
    CAN_SEG1_Mul_4TQ = (((uint32_t)0x3) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 4 x TQ */
    CAN_SEG1_Mul_5TQ = (((uint32_t)0x4) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 5 x TQ */
    CAN_SEG1_Mul_6TQ = (((uint32_t)0x5) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 6 x TQ */
    CAN_SEG1_Mul_7TQ = (((uint32_t)0x6) << CAN_BITTMNG_SEG1_Pos), /*!< Phase Segment 1 time = 7 x TQ */
    CAN_SEG1_Mul_8TQ = (((uint32_t)0x7) << CAN_BITTMNG_SEG1_Pos)  /*!< Phase Segment 1 time = 8 x TQ */
} CAN_Phase_Seg1_Time;

#define IS_CAN_SEG1_VALUE(VALUE)  (((VALUE) == CAN_SEG1_Mul_1TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_2TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_3TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_4TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_5TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_6TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_7TQ) || \
                                   ((VALUE) == CAN_SEG1_Mul_8TQ))

/**
  * @brief CAN Phase Segment 2 time
  */
typedef enum
{
    CAN_SEG2_Mul_1TQ = (((uint32_t)0x0) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 1 x TQ */
    CAN_SEG2_Mul_2TQ = (((uint32_t)0x1) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 2 x TQ */
    CAN_SEG2_Mul_3TQ = (((uint32_t)0x2) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 3 x TQ */
    CAN_SEG2_Mul_4TQ = (((uint32_t)0x3) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 4 x TQ */
    CAN_SEG2_Mul_5TQ = (((uint32_t)0x4) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 5 x TQ */
    CAN_SEG2_Mul_6TQ = (((uint32_t)0x5) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 6 x TQ */
    CAN_SEG2_Mul_7TQ = (((uint32_t)0x6) << CAN_BITTMNG_SEG2_Pos), /*!< Phase Segment 2 time = 7 x TQ */
    CAN_SEG2_Mul_8TQ = (((uint32_t)0x7) << CAN_BITTMNG_SEG2_Pos)  /*!< Phase Segment 2 time = 8 x TQ */
} CAN_Phase_Seg2_Time;

#define IS_CAN_SEG2_VALUE(VALUE)  (((VALUE) == CAN_SEG2_Mul_1TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_2TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_3TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_4TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_5TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_6TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_7TQ) || \
                                   ((VALUE) == CAN_SEG2_Mul_8TQ))

/**
  * @brief CAN Synchronizations jump width time
  */
typedef enum
{
    CAN_SJW_Mul_1TQ = (((uint32_t)0x0) << CAN_BITTMNG_SJW_Pos), /*!< Synchronization jump width time = 1 x TQ */
    CAN_SJW_Mul_2TQ = (((uint32_t)0x1) << CAN_BITTMNG_SJW_Pos), /*!< Synchronization jump width time = 2 x TQ */
    CAN_SJW_Mul_3TQ = (((uint32_t)0x2) << CAN_BITTMNG_SJW_Pos), /*!< Synchronization jump width time = 3 x TQ */
    CAN_SJW_Mul_4TQ = (((uint32_t)0x3) << CAN_BITTMNG_SJW_Pos)  /*!< Synchronization jump width time = 4 x TQ */
} CAN_SJW_Time;

#define IS_CAN_SJW_VALUE(VALUE)    (((VALUE) == CAN_SJW_Mul_1TQ) || \
                                    ((VALUE) == CAN_SJW_Mul_2TQ) || \
                                    ((VALUE) == CAN_SJW_Mul_3TQ) || \
                                    ((VALUE) == CAN_SJW_Mul_4TQ))

/**
  * @brief CAN Sampling mode
  */
typedef enum
{
    CAN_SB_1_SAMPLE = (((uint32_t)0x0) << CAN_BITTMNG_SB_Pos), /*!< One sample is enough */
    CAN_SB_3_SAMPLE = (((uint32_t)0x1) << CAN_BITTMNG_SB_Pos)  /*!< Three samples should be obtained */
} CAN_Sampling_Mode;

