ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_can.h
#define IS_CAN_SAMPLING_MODE(MODE) (((MODE) == CAN_SB_1_SAMPLE) || \
                                    ((MODE) == CAN_SB_3_SAMPLE))

/**
  * @brief CAN Identifier Type
  */
typedef enum
{
    CAN_ID_STD = ((uint8_t)0x0), /*!< Standard Id */
    CAN_ID_EXT = ((uint8_t)0x1)  /*!< Extended Id */
} CAN_Identifier_Type;

#define IS_CAN_IDTYPE(IDTYPE) (((IDTYPE) == CAN_ID_STD) || ((IDTYPE) == CAN_ID_EXT))

/**
  * @brief CAN Interrupts
  */
typedef enum
{
    CAN_IT_GLBINTEN     = (((uint32_t)0x1) <<  0), /*!< General flag that enables CAN module interrupts */
    CAN_IT_RXINTEN      = (((uint32_t)0x1) <<  1), /*!< Flag that enables interrupt on message reception */
    CAN_IT_TXINTEN      = (((uint32_t)0x1) <<  2), /*!< Flag that enables interrupt if transmission becomes available */
    CAN_IT_ERRINTEN     = (((uint32_t)0x1) <<  3), /*!< Flag that enables interrupt on error */
    CAN_IT_ERROVERINTEN = (((uint32_t)0x1) <<  4)  /*!< Flag that enables interrupt on TEC or REC exceeds ERROR_MAX value */
} CAN_IT_Def;

#define CAN_IT_MASK     (CAN_IT_GLBINTEN | CAN_IT_RXINTEN | CAN_IT_TXINTEN | \
                         CAN_IT_ERRINTEN | CAN_IT_ERROVERINTEN)

#define IS_CAN_ITConfig(IT)  (((IT) & (~CAN_IT_MASK)) == 0)

/**
  * @brief CAN Clock BRG
  */
typedef enum
{
    CAN_HCLKdiv1   = ((uint32_t)0x00),
    CAN_HCLKdiv2   = ((uint32_t)0x01),
    CAN_HCLKdiv4   = ((uint32_t)0x02),
    CAN_HCLKdiv8   = ((uint32_t)0x03),
    CAN_HCLKdiv16  = ((uint32_t)0x04),
    CAN_HCLKdiv32  = ((uint32_t)0x05),
    CAN_HCLKdiv64  = ((uint32_t)0x06),
    CAN_HCLKdiv128 = ((uint32_t)0x07)
} CAN_Clock_BRG;

#define IS_CAN_CLOCK_BRG(BRG)      ((BRG) <= 7)

/**
  * @brief CAN init structure definition
  */
typedef struct
{
    FunctionalState      CAN_ROP;            /*!< Enables or disables own packets reception.
                                                  This parameter can be a value of @ref FunctionalState */
    FunctionalState      CAN_SAP;            /*!< Enables or disables sending ACK on own packets.
                                                  This parameter can be a value of @ref FunctionalState */
    FunctionalState      CAN_STM;            /*!< Enables or disables Self Test mode.
                                                  This parameter can be a value of @ref FunctionalState */
    FunctionalState      CAN_ROM;            /*!< Enables or disables Read Only mode.
                                                  This parameter can be a value of @ref FunctionalState */
    CAN_Propagation_Time CAN_PSEG;           /*!< Specifies the Propagation time.
                                                  This parameter is one of @ref CAN_Propagation_Time values. */
    CAN_Phase_Seg1_Time  CAN_SEG1;           /*!< Specifies the Phase Segment 1 time.
                                                  This parameter is one of @ref CAN_Phase_Seg1_Time values. */
    CAN_Phase_Seg2_Time  CAN_SEG2;           /*!< Specifies the Phase Segment 2 time.
                                                  This parameter is one of @ref CAN_Phase_Seg2_Time values. */
    CAN_SJW_Time         CAN_SJW;            /*!< Specifies the Synchronizations jump width time.
                                                  This parameter is one of @ref CAN_SJW_Time values. */
    CAN_Sampling_Mode    CAN_SB;             /*!< Specifies the Sampling mode.
                                                  This parameter is one of @ref CAN_Sampling_Mode */
    uint16_t             CAN_BRP;            /*!< Specifies the System Clock Prescaler. Used to calculate Time Quanta
                                                  by the following algorithm:
                                                  CLK = PCLK/(BRP + 1)
                                                  TQ(microsec) = (BRP + 1)/CLK(MHz) */
    uint8_t              CAN_OVER_ERROR_MAX; /*!< Specifies the upper limit for TEC / REC error counters before
                                                  ERROR_OVER flag is set. */
} CAN_InitTypeDef;

/**
  * @brief CAN Buffer Data container definition
  */
typedef uint32_t CAN_DataTypeDef[2];

/**
  * @brief CAN Transmitted message structure definition
  */
typedef struct
{
    uint32_t ID;          /*!< Specifies the full (Standard or Extended) identifier.
                               To set Standard ID, the macro CAN_STDID_TO_EXTID should
                               be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                               @ref CAN_ID_conversion
                               This parameter can be a value between 0 to 0x1FFFFFFF. */
    uint8_t PRIOR_0;      /*!< Specifies sending priority.
                               This parameter can be a value of @ref FunctionalState. */
    uint8_t IDE;          /*!< Specifies the type of identifier for the message that will be transmitted.
                               This parameter can be a value of @ref CAN_Identifier_Type */
    uint8_t DLC;          /*!< Specifies the length of the frame that will be transmitted.
                               This parameter can be a value between 0 to 8 */
    CAN_DataTypeDef Data; /*!< Contains the data to be transmitted. */
} CAN_TxMsgTypeDef;

/**
  * @brief CAN Remote Transfer Request structure definition
  */
typedef struct
{
    uint32_t ID;     /*!< Specifies the full (Standard or Extended) identifier.
                          To set Standard ID, the macro CAN_STDID_TO_EXTID should
                          be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                          @ref CAN_ID_conversion
                          This parameter can be a value between 0 to 0x1FFFFFFF. */
    uint8_t PRIOR_0; /*!< Specifies sending priority.
                          This parameter can be a value of @ref FunctionalState. */
    uint8_t IDE;     /*!< Specifies the type of identifier for the message that will be transmitted.
                          This parameter can be a value of @ref CAN_Identifier_Type */
} CAN_RTRMessageTypeDef;

/**
  * @brief CAN Remote Transfer Request Reply structure definition
  */
typedef struct
{
    uint32_t ID;          /*!< Specifies the full (Standard or Extended) identifier.
                               To set Standard ID, the macro CAN_STDID_TO_EXTID should
                               be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                               @ref CAN_ID_conversion
                               This parameter can be a value between 0 to 0x1FFFFFFF. */
    uint8_t IDE;          /*!< Specifies the type of identifier for the message that will be transmitted.
                               This parameter can be a value of @ref CAN_Identifier_Type */
    uint8_t DLC;          /*!< Specifies the length of the frame that will be transmitted.
                               This parameter can be a value between 0 to 8 */
    CAN_DataTypeDef Data; /*!< Contains the data to be transmitted. */
} CAN_RTRReplyTypeDef;

/**
  * @brief CAN Received message header structure definition
  */
typedef struct
{
    uint32_t ID;     /*!< Specifies the full (Standard or Extended) identifier.
                          To set Standard ID, the macro CAN_STDID_TO_EXTID should
                          be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                          @ref CAN_ID_conversion
                          This parameter can be a value between 0 to 0x1FFFFFFF. */
    uint8_t OVER_EN; /*!< Specifies if the received message could be rewritten.
                          This parameter can be a value of FunctionalState. */
    uint8_t IDE;     /*!< Specifies the type of identifier for the message that will be received.
                          This parameter can be a value of @ref CAN_Identifier_Type */
    uint8_t DLC;     /*!< Specifies the length of the frame that will be transmitted.
                          This parameter can be a value between 0 to 8 */
} CAN_RxMsgHeaderTypeDef;

/**
  * @brief  CAN Received message structure definition
  */
typedef struct
{
    CAN_RxMsgHeaderTypeDef Rx_Header;  /*!< Contains message header. */
    CAN_DataTypeDef Data;              /*!< Contains received data. */
} CAN_RxMsgTypeDef;

/**
  * @brief  CAN filter init structure definition
  */
typedef struct
{
    uint32_t Filter_ID; /*!< Specifies standard identifier for the filter.
                             This parameter can be a value between 0 to 0x1FFFFFFF. */
    uint32_t Mask_ID;   /*!< Specifies standard identifier for the mask.
                             This parameter can be a value between 0 to 0x1FFFFFFF. */
} CAN_FilterInitTypeDef;

/** @} */ /* End of group CAN_Exported_Types */


